#layer {
#  name: "data"
#  type: "ImageData"
#  top: "data"
#  top: "label"
#  image_data_param {
#    source: "../../../data/textures/textures.txt"
#    batch_size: 1
#  }
#}
layer {
  name: "data"
  type: "NoiseData"
  top: "data"
  noise_data_param {
    batch_size: 1
    channels: 3
    spatial_size: 64
    distribution: "gaussian"
    mu: 0
    sigma: 9
  }
}
layer {
  name: "upsample"
  type: "Deconvolution"
  bottom: "data"
  top: "upsample"
  convolution_param {
    kernel_size: 2
    stride: 2
    num_output: 3
    group: 3
    pad: 1
    weight_filler: { 
      type: "constant"
      value: 1
    }
    bias_term: false
  }
  param { lr_mult: 0 decay_mult: 0 }
}
