layer {
  name: "data"
  type: "ImageData"
  top: "data"
  top: "label"
  image_data_param {
    source: "../../../data/textures/textures.txt"
    batch_size: 1
  }
}
#layer {
#  name: "data"
#  type: "NoiseData"
#  top: "data"
#  noise_data_param {
#    batch_size: 1
#    channels: 3
#    spatial_size: 6
#    distribution: "gaussian"
#    mu: 0
#    sigma: 1
#  }
#}
#name: "gramian"
#input: "data"
#input_dim: 1
#input_dim: 2
#input_dim: 3
#input_dim: 3
#layer {
#  name: "gramian"
#  type: "Gramian"
#  bottom: "data"
#  top: "gramian"
#  gramian_param {
#    normalize_output: true
#  }
#}
layer {
  name: "upsample"
  type: "Deconvolution"
  bottom: "data"
  top: "upsample"
  convolution_param {
    kernel_size: 2
    stride: 2
    num_output: 3
    group: 3
    pad: 0
    weight_filler: { 
      type: "constant"
      value: 1
    }
    bias_term: false
  }
  param { lr_mult: 0 decay_mult: 0 }
}
