name: "TextureGeneratorNet"
layer {
  name: "data1"
  type: "NoiseData"
  top: "data1"
  noise_data_param {
    batch_size: 16
    channels: 3
    spatial_size: 16
    distribution: "uniform"
    min: -1
    max: 1
  }
}
layer {
  name: "block_conv1"
  type: "Convolution"
  bottom: "data1"
  top: "block_conv1"
  convolution_param {
    num_output: 8
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "block_bn1"
  type: "BatchNorm"
  bottom: "block_conv1"
  top: "block_bn1"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}
layer {
  name: "block_relu1"
  type: "ReLU"
  bottom: "block_bn1"
  top: "block_bn1"
}
layer {
  name: "block_conv2"
  type: "Convolution"
  bottom: "block_bn1"
  top: "block_conv2"
  convolution_param {
    num_output: 8
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "block_bn2"
  type: "BatchNorm"
  bottom: "block_conv2"
  top: "block_bn2"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}
layer {
  name: "block_relu2"
  type: "ReLU"
  bottom: "block_bn2"
  top: "block_bn2"
}
layer {
  name: "block_conv3"
  type: "Convolution"
  bottom: "block_bn2"
  top: "block_conv3"
  convolution_param {
    num_output: 8
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "block_bn3"
  type: "BatchNorm"
  bottom: "block_conv3"
  top: "block_bn3"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}
layer {
  name: "block_relu3"
  type: "ReLU"
  bottom: "block_bn3"
  top: "block_bn3"
}
layer {
  name: "join_small_nnup1"
  type: "Deconvolution"
  bottom: "block_bn3"
  top: "join_small_nnup1"
  param {
    lr_mult: 0
  }
  param {
    decay_mult: 0
  }
  convolution_param {
    num_output: 3
    bias_term: false
    pad: 1
    kernel_size: 2
    group: 3
    stride: 2
    weight_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "join_small_bn1"
  type: "BatchNorm"
  bottom: "join_small_nnup1"
  top: "join_small_bn1"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}
layer {
  name: "data2"
  type: "NoiseData"
  top: "data2"
  noise_data_param {
    batch_size: 16
    channels: 3
    spatial_size: 32
    distribution: "uniform"
    min: -1
    max: 1
  }
}
layer {
  name: "block_conv4"
  type: "Convolution"
  bottom: "data2"
  top: "block_conv4"
  convolution_param {
    num_output: 8
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "block_bn4"
  type: "BatchNorm"
  bottom: "block_conv4"
  top: "block_bn4"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}
layer {
  name: "block_relu4"
  type: "ReLU"
  bottom: "block_bn4"
  top: "block_bn4"
}
layer {
  name: "block_conv5"
  type: "Convolution"
  bottom: "block_bn4"
  top: "block_conv5"
  convolution_param {
    num_output: 8
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "block_bn5"
  type: "BatchNorm"
  bottom: "block_conv5"
  top: "block_bn5"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}
layer {
  name: "block_relu5"
  type: "ReLU"
  bottom: "block_bn5"
  top: "block_bn5"
}
layer {
  name: "block_conv6"
  type: "Convolution"
  bottom: "block_bn5"
  top: "block_conv6"
  convolution_param {
    num_output: 8
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "block_bn6"
  type: "BatchNorm"
  bottom: "block_conv6"
  top: "block_bn6"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}
layer {
  name: "block_relu6"
  type: "ReLU"
  bottom: "block_bn6"
  top: "block_bn6"
}
layer {
  name: "join_large_bn1"
  type: "BatchNorm"
  bottom: "block_bn6"
  top: "join_large_bn1"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}
layer {
  name: "join_concat1"
  type: "Concat"
  bottom: "join_small_bn1"
  bottom: "join_large_bn1"
  top: "join_concat1"
  concat_param {
    axis: 1
  }
}
layer {
  name: "block_conv7"
  type: "Convolution"
  bottom: "join_concat1"
  top: "block_conv7"
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "block_bn7"
  type: "BatchNorm"
  bottom: "block_conv7"
  top: "block_bn7"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}
layer {
  name: "block_relu7"
  type: "ReLU"
  bottom: "block_bn7"
  top: "block_bn7"
}
layer {
  name: "block_conv8"
  type: "Convolution"
  bottom: "block_bn7"
  top: "block_conv8"
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "block_bn8"
  type: "BatchNorm"
  bottom: "block_conv8"
  top: "block_bn8"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}
layer {
  name: "block_relu8"
  type: "ReLU"
  bottom: "block_bn8"
  top: "block_bn8"
}
layer {
  name: "block_conv9"
  type: "Convolution"
  bottom: "block_bn8"
  top: "block_conv9"
  convolution_param {
    num_output: 16
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "block_bn9"
  type: "BatchNorm"
  bottom: "block_conv9"
  top: "block_bn9"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}
layer {
  name: "block_relu9"
  type: "ReLU"
  bottom: "block_bn9"
  top: "block_bn9"
}
layer {
  name: "join_small_nnup2"
  type: "Deconvolution"
  bottom: "block_bn3"
  top: "join_small_nnup2"
  param {
    lr_mult: 0
  }
  param {
    decay_mult: 0
  }
  convolution_param {
    num_output: 3
    bias_term: false
    pad: 1
    kernel_size: 2
    group: 3
    stride: 2
    weight_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "join_small_bn2"
  type: "BatchNorm"
  bottom: "join_small_nnup2"
  top: "join_small_bn2"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}
layer {
  name: "data3"
  type: "NoiseData"
  top: "data3"
  noise_data_param {
    batch_size: 16
    channels: 3
    spatial_size: 64
    distribution: "uniform"
    min: -1
    max: 1
  }
}
layer {
  name: "Convolution1"
  type: "Convolution"
  bottom: "data3"
  top: "Convolution1"
  convolution_param {
    num_output: 8
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "BatchNorm1"
  type: "BatchNorm"
  bottom: "Convolution1"
  top: "BatchNorm1"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}
layer {
  name: "ReLU1"
  type: "ReLU"
  bottom: "BatchNorm1"
  top: "BatchNorm1"
}
layer {
  name: "Convolution2"
  type: "Convolution"
  bottom: "BatchNorm1"
  top: "Convolution2"
  convolution_param {
    num_output: 8
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "BatchNorm2"
  type: "BatchNorm"
  bottom: "Convolution2"
  top: "BatchNorm2"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}
layer {
  name: "ReLU2"
  type: "ReLU"
  bottom: "BatchNorm2"
  top: "BatchNorm2"
}
layer {
  name: "Convolution3"
  type: "Convolution"
  bottom: "BatchNorm2"
  top: "Convolution3"
  convolution_param {
    num_output: 8
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "BatchNorm3"
  type: "BatchNorm"
  bottom: "Convolution3"
  top: "BatchNorm3"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}
layer {
  name: "ReLU3"
  type: "ReLU"
  bottom: "BatchNorm3"
  top: "BatchNorm3"
}
layer {
  name: "join_large_bn2"
  type: "BatchNorm"
  bottom: "BatchNorm3"
  top: "join_large_bn2"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}
layer {
  name: "join_concat2"
  type: "Concat"
  bottom: "join_small_bn2"
  bottom: "join_large_bn2"
  top: "join_concat2"
  concat_param {
    axis: 1
  }
}
layer {
  name: "block_conv10"
  type: "Convolution"
  bottom: "join_concat2"
  top: "block_conv10"
  convolution_param {
    num_output: 24
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "block_bn10"
  type: "BatchNorm"
  bottom: "block_conv10"
  top: "block_bn10"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}
layer {
  name: "block_relu10"
  type: "ReLU"
  bottom: "block_bn10"
  top: "block_bn10"
}
layer {
  name: "block_conv11"
  type: "Convolution"
  bottom: "block_bn10"
  top: "block_conv11"
  convolution_param {
    num_output: 24
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "block_bn11"
  type: "BatchNorm"
  bottom: "block_conv11"
  top: "block_bn11"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}
layer {
  name: "block_relu11"
  type: "ReLU"
  bottom: "block_bn11"
  top: "block_bn11"
}
layer {
  name: "block_conv12"
  type: "Convolution"
  bottom: "block_bn11"
  top: "block_conv12"
  convolution_param {
    num_output: 24
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "block_bn12"
  type: "BatchNorm"
  bottom: "block_conv12"
  top: "block_bn12"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}
layer {
  name: "block_relu12"
  type: "ReLU"
  bottom: "block_bn12"
  top: "block_bn12"
}
layer {
  name: "block_conv13"
  type: "Convolution"
  bottom: "block_bn12"
  top: "block_conv13"
  convolution_param {
    num_output: 3
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "block_bn13"
  type: "BatchNorm"
  bottom: "block_conv13"
  top: "block_bn13"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}
layer {
  name: "block_relu13"
  type: "ReLU"
  bottom: "block_bn13"
  top: "block_bn13"
}

