#layer {
#  name: "data"
#  type: "ImageData"
#  top: "data"
#  top: "label"
#  image_data_param {
#    source: "../../data/textures/textures.txt"
#    batch_size: 1
#  }
#}
layer {
  name: "data"
  type: "NoiseData"
  top: "data"
  noise_data_param {
    batch_size: 2
    channels: 3
    spatial_size: 6
    distribution: "gaussian"
    mu: 0
    sigma: 1
  }
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "conv_relu1"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "gramian"
  type: "Gramian"
  bottom: "conv1"
  top: "gramian"
  gramian_param {
    normalize_output: true
  }
}
#layer {
#  name: "upsample"
#  type: "Deconvolution"
#  bottom: "data"
#  top: "upsample"
#  convolution_param {
#    kernel_size: 2
#    stride: 2
#    num_output: 3
#    group: 3
#    pad: 0
#    weight_filler: { 
#      type: "constant"
#      value: 1
#    }
#    bias_term: false
#  }
#  param { lr_mult: 0 decay_mult: 0 }
#}
layer {
  name: "input"
  type: "Input"
  top: "dummydata"
  input_param {
    shape {
      dim: 2
      dim: 1
      dim: 1
      dim: 4096
    }
  }
}
layer {
  name: "loss"
  type: "EuclideanLoss"
  bottom: "gramian"
  bottom: "dummydata"
  top: "loss"
}
